# StructuralSectionRectangular Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionRectangular Class
Members See Also
---
Defines common set of parameters for structural section rectangular contour.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class StructuralSectionRectangular : StructuralSection
```

Visual Basic
---
```text
Public Class StructuralSectionRectangular _
	Inherits StructuralSection
```

Visual C++
---
```text
public ref class StructuralSectionRectangular : public StructuralSection
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionColdFormed Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionConcreteCross Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionConcreteRectangle Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionConcreteRectangleCut Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionConcreteT Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralF Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralH Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionHotRolled Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionIWelded Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionUserDefined
# See Also
StructuralSectionRectangular Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace